In [23]:
import pandas
# for data manupulation

In [24]:
df1= pandas.DataFrame([[3,6,2,9,1,0],[672,34,4],[39,8]])
df1

     0   1    2    3    4    5
0    3   6  2.0  9.0  1.0  0.0
1  672  34  4.0  NaN  NaN  NaN
2   39   8  NaN  NaN  NaN  NaN

In [25]:
df2= pandas.DataFrame([[3,6,2],[672,34,4],[39,8]],columns=['Price','age','value'])
df2

   Price  age  value
0      3    6    2.0
1    672   34    4.0
2     39    8    NaN

In [26]:
df3 = pandas.DataFrame([{'name':'john','surname':'johns'},{'name':'jack'}])
df3

   name surname
0  john   johns
1  jack     NaN

In [28]:
type(df2)
df2.mean()

Price    238.0
age       16.0
value      3.0
dtype: float64